# Gathering Data
## Data gathering Process

In [5]:
Data = {
    "Name":["John", "Jane", "Doe","Sam","Anna"],
    "Age":[28, 22, 35, 30, 25],
    "City":["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Occupation":["Engineer", "Doctor", "Artist", "Teacher", "Nurse"],
    "Salary":[70000, 120000, 50000, 60000, 55000]
    
}

In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame(Data)

In [8]:
# how to read my Data
print(df.head())

   Name  Age         City Occupation  Salary
0  John   28     New York   Engineer   70000
1  Jane   22  Los Angeles     Doctor  120000
2   Doe   35      Chicago     Artist   50000
3   Sam   30      Houston    Teacher   60000
4  Anna   25      Phoenix      Nurse   55000

In [9]:
df = pd.read_csv("Data/course_offerings.csv", sep='|')

In [10]:
print(df.head())

             course_id,course_name,instructor
0            101,Intro to Python,Chris Bruehl
1                102,Intro to SQL,John Pauler
2    201,Exploratory Data Analysis,Alice Zhao
3                 301,Algorithms,Chris Bruehl
4  331,Natural Language Processing,Alice Zhao

In [ ]:
# use in separated values
df = pd.read_csv("Data/course_offerings.csv", sep=',')

In [15]:
print(df.head())

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [16]:
df_1 = pd.read_excel("Data/Course Offerings.xlsx", index_col=0)

In [17]:
print(df_1.head())

                                Title
Instructor
Chris Bruehl   Lead Python Instructor
John Pauler      Chief Growth Officer
Alice Zhao    Data Science Instructor

In [18]:
pd.read_excel("Data/Course Offerings.xlsx", sheet_name=0)

     Instructor                    Title
0  Chris Bruehl   Lead Python Instructor
1   John Pauler     Chief Growth Officer
2    Alice Zhao  Data Science Instructor

In [19]:
pd.read_excel("Data/Course Offerings.xlsx", sheet_name=1)

   Course ID                  Course Name    Instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

# Connect to SQL databases

In [20]:
import sqlite3

In [21]:
conn = sqlite3.connect("Data/maven.db")

In [22]:
pd.read_sql("SELECT * FROM courses", conn)

   course_id                       course    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

# Cleaning Data
## The goal data cleaning is to get raw data  into a format that's readly for analysis.

In [23]:
df= pd.read_excel('Data/Run Times.xlsx')

In [24]:
run_times = df.set_index('Run Time')
print(run_times.head())

            Name Warm Up Time   Location            Run Date  Race Date  \
Run Time
9.2343    Alexis          3.5   “school” 2023-04-15 12:00:00 2023-06-01
10.3842   Alexis          3.5     School 2023-04-22 12:30:00 2023-06-01
8.1209    Alexis        3 min  “the gym” 2023-05-10 15:00:00 2023-06-01
7.2123     David          2.2   “school” 2023-05-01 15:15:00 2023-06-15
6.8342     David            2      “gym” 2023-05-10 16:30:00 2023-06-15

           Rain    Fee
Run Time
9.2343    False  $0.00
10.3842    True  $0.00
8.1209    False  $2.50
7.2123    False  $0.00
6.8342    False  $2.50

In [25]:
run_times.dtypes

Name                    object
Warm Up Time            object
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                     object
dtype: object

In [26]:
run_times.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 9.2343 to 6.8342
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          5 non-null      object
 1   Warm Up Time  5 non-null      object
 2   Location      5 non-null      object
 3   Run Date      5 non-null      datetime64[ns]
 4   Race Date     5 non-null      datetime64[ns]
 5   Rain          5 non-null      bool
 6   Fee           5 non-null      object
dtypes: bool(1), datetime64[ns](2), object(4)
memory usage: 285.0+ bytes

# Coverting to datetime

In [27]:
run_times.Fee.str.replace('$', '')

Run Time
9.2343     0.00
10.3842    0.00
8.1209     2.50
7.2123     0.00
6.8342     2.50
Name: Fee, dtype: object

In [28]:
pd.to_numeric(run_times.Fee.str.replace('$', ''))

Run Time
9.2343     0.0
10.3842    0.0
8.1209     2.5
7.2123     0.0
6.8342     2.5
Name: Fee, dtype: float64

In [29]:
run_times.dtypes

Name                    object
Warm Up Time            object
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                     object
dtype: object

In [30]:
run_times.Fee =pd.to_numeric(run_times.Fee.str.replace('$', ''))
print(run_times.dtypes)

Name                    object
Warm Up Time            object
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                    float64
dtype: object

In [76]:
run_times.head()

,Name,Warm Up Time,Location,Run Date,Race Date,Rain,Fee
Run Time,,,,,,,
9.2343,Alexis,3.5,“school”,2023-04-15 12:00:00,2023-06-01,False,0.0
10.3842,Alexis,3.5,School,2023-04-22 12:30:00,2023-06-01,True,0.0
8.1209,Alexis,3 min,“the gym”,2023-05-10 15:00:00,2023-06-01,False,2.5
7.2123,David,2.2,“school”,2023-05-01 15:15:00,2023-06-15,False,0.0
6.8342,David,2,“gym”,2023-05-10 16:30:00,2023-06-15,False,2.5

In [31]:
run_times['Warm Up Time']

Run Time
9.2343       3.5
10.3842      3.5
8.1209     3 min
7.2123       2.2
6.8342         2
Name: Warm Up Time, dtype: object

In [32]:
pd.to_numeric(run_times['Warm Up Time'], errors='coerce')

Run Time
9.2343     3.5
10.3842    3.5
8.1209     NaN
7.2123     2.2
6.8342     2.0
Name: Warm Up Time, dtype: float64

In [33]:
run_times['Warm Up Time']

Run Time
9.2343       3.5
10.3842      3.5
8.1209     3 min
7.2123       2.2
6.8342         2
Name: Warm Up Time, dtype: object

In [34]:
run_times['Warm Up Time'].str.replace(' min', '')

Run Time
9.2343     NaN
10.3842    NaN
8.1209       3
7.2123     NaN
6.8342     NaN
Name: Warm Up Time, dtype: object

In [35]:
run_times['Warm Up Time'].astype('str').str.replace(' min', '')

Run Time
9.2343     3.5
10.3842    3.5
8.1209       3
7.2123     2.2
6.8342       2
Name: Warm Up Time, dtype: object

In [85]:
pd.to_numeric(run_times['Warm Up Time'].astype('str').str.replace(' min', ''))

Run Time
9.2343     3.5
10.3842    3.5
8.1209     3.0
7.2123     2.2
6.8342     2.0
Name: Warm Up Time, dtype: float64

In [36]:
run_times.dtypes

Name                    object
Warm Up Time            object
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                    float64
dtype: object

In [37]:
run_times.head()

,Name,Warm Up Time,Location,Run Date,Race Date,Rain,Fee
Run Time,,,,,,,
9.2343,Alexis,3.5,“school”,2023-04-15 12:00:00,2023-06-01,False,0.0
10.3842,Alexis,3.5,School,2023-04-22 12:30:00,2023-06-01,True,0.0
8.1209,Alexis,3 min,“the gym”,2023-05-10 15:00:00,2023-06-01,False,2.5
7.2123,David,2.2,“school”,2023-05-01 15:15:00,2023-06-15,False,0.0
6.8342,David,2,“gym”,2023-05-10 16:30:00,2023-06-15,False,2.5

In [38]:
# change the column name run boolean type
run_times.Rain.astype('int')

Run Time
9.2343     0
10.3842    1
8.1209     0
7.2123     0
6.8342     0
Name: Rain, dtype: int32

## Missing Data

In [39]:
# Update the file path to the correct location of the file
df = pd.read_excel('Data/Student Grades.xlsx')  # Replace 'Data/Student Grades.xlsx' with the actual path to your file

In [40]:
df.head()

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [41]:
df.tail()

    Student Class    Year  Grade
81      NaN   NaN     NaN    NaN
82  Bennett   NaN     NaN    NaN
83      NaN   EDA  Junior   84.0
84    Gavin   EDA  Senior    NaN
85   Calvin   NaN     NaN  100.0

In [42]:
df.dtypes

Student     object
Class       object
Year        object
Grade      float64
dtype: object

In [43]:
import numpy as np

In [ ]:
# np.nan is used to represent missing values in pandas
np.nan

nan

In [46]:
# pd.NA is used to represent missing values in pandas
pd.NA

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86 entries, 0 to 85
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  84 non-null     object
 1   Class    83 non-null     object
 2   Year     80 non-null     object
 3   Grade    82 non-null     float64
dtypes: float64(1), object(3)
memory usage: 2.8+ KB

In [47]:
df.value_counts()

Student  Class            Year       Grade
Isaac    Intro to SQL     Sophomore  96.0     3
Aaron    EDA              Junior     85.0     1
Joseph   Intro to Python  Freshman   93.0     1
Luke     Intro to SQL     Sophomore  76.0     1
Lucas    Intro to Python  Freshman   77.0     1
                                             ..
Eli      EDA              Junior     92.0     1
Dylan    Intro to Python  Freshman   84.0     1
David    Intro to Python  Freshman   74.0     1
Daniel   Intro to Python  Freshman   85.0     1
Zoey     EDA              Junior     91.0     1
Name: count, Length: 75, dtype: int64

In [48]:
df.Year.value_counts()

Year
Freshman     35
Sophomore    24
Junior       20
Senior        1
Name: count, dtype: int64

In [49]:
df.Year.value_counts(dropna=False)

Year
Freshman     35
Sophomore    24
Junior       20
NaN           6
Senior        1
Name: count, dtype: int64

In [ ]:
# Check for missing values in the entire DataFrame
df.isna()

    Student  Class   Year  Grade
0     False  False  False  False
1     False  False  False  False
2     False  False  False  False
3     False  False  False  False
4     False  False  False  False
..      ...    ...    ...    ...
81     True   True   True   True
82    False   True   True   True
83     True  False  False  False
84    False  False  False   True
85    False   True   True  False

[86 rows x 4 columns]

In [ ]:
# Check for missing values in each column
df.isna().sum()

Student    2
Class      3
Year       6
Grade      4
dtype: int64

In [ ]:
# Check for missing values in each row
df.isna().any(axis=1)

0     False
1     False
2     False
3     False
4     False
      ...
81     True
82     True
83     True
84     True
85     True
Length: 86, dtype: bool

In [52]:
# Check for rows with missing values
df[df.isna().any(axis=1)]

    Student                      Class    Year  Grade
7     Jacob           Freshman Seminar     NaN   88.0
8   William           Freshman Seminar     NaN   89.0
9     Ethan           Freshman Seminar     NaN   86.0
62   Landon  Exploratory Data Analysis  Junior    NaN
81      NaN                        NaN     NaN    NaN
82  Bennett                        NaN     NaN    NaN
83      NaN                        EDA  Junior   84.0
84    Gavin                        EDA  Senior    NaN
85   Calvin                        NaN     NaN  100.0

In [54]:
df["Year"].isna()

0     False
1     False
2     False
3     False
4     False
      ...
81     True
82     True
83    False
84    False
85     True
Name: Year, Length: 86, dtype: bool

In [55]:
df["Year"].count()

80

In [56]:
df.dropna()

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
76     Zoey               EDA    Junior   91.0
77    Aaron               EDA    Junior   85.0
78  Charles               EDA    Junior   93.0
79   Connor               EDA    Junior   91.0
80    Riley               EDA    Junior   87.0

[77 rows x 4 columns]

In [59]:
# Drop rows with any missing values
df.dropna(axis=0, how='all')

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
80    Riley               EDA    Junior   87.0
82  Bennett               NaN       NaN    NaN
83      NaN               EDA    Junior   84.0
84    Gavin               EDA    Senior    NaN
85   Calvin               NaN       NaN  100.0

[85 rows x 4 columns]

In [ ]:
# 
df.dropna(thresh=2)

   Student             Class      Year  Grade
0     Emma  Freshman Seminar  Freshman   86.0
1   Olivia  Freshman Seminar  Freshman   86.0
2     Noah  Freshman Seminar  Freshman   86.0
3   Sophia  Freshman Seminar  Freshman   87.0
4     Liam  Freshman Seminar  Freshman   90.0
..     ...               ...       ...    ...
79  Connor               EDA    Junior   91.0
80   Riley               EDA    Junior   87.0
83     NaN               EDA    Junior   84.0
84   Gavin               EDA    Senior    NaN
85  Calvin               NaN       NaN  100.0

[84 rows x 4 columns]

In [ ]:
# Drop rows with missing values in the 'Class' column
df.dropna(subset =["Class"])

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
78  Charles               EDA    Junior   93.0
79   Connor               EDA    Junior   91.0
80    Riley               EDA    Junior   87.0
83      NaN               EDA    Junior   84.0
84    Gavin               EDA    Senior    NaN

[83 rows x 4 columns]

In [ ]:

df[df["Class"].notna()]

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
78  Charles               EDA    Junior   93.0
79   Connor               EDA    Junior   91.0
80    Riley               EDA    Junior   87.0
83      NaN               EDA    Junior   84.0
84    Gavin               EDA    Senior    NaN

[83 rows x 4 columns]

In [66]:
# Map categorical values to numeric values
year_mapping = {'Freshman': 1, 'Sophomore': 2, 'Junior': 3, 'Senior': 4}
df["Year"] = df["Year"].map(year_mapping)

# Fill missing values with the median
df["Year"] = df["Year"].fillna(df["Year"].median())

In [67]:
df

    Student             Class  Year  Grade
0      Emma  Freshman Seminar   1.0   86.0
1    Olivia  Freshman Seminar   1.0   86.0
2      Noah  Freshman Seminar   1.0   86.0
3    Sophia  Freshman Seminar   1.0   87.0
4      Liam  Freshman Seminar   1.0   90.0
..      ...               ...   ...    ...
81      NaN               NaN   2.0    NaN
82  Bennett               NaN   2.0    NaN
83      NaN               EDA   3.0   84.0
84    Gavin               EDA   4.0    NaN
85   Calvin               NaN   2.0  100.0

[86 rows x 4 columns]

In [68]:
# Resolving missing values in the 'Class' column
df["Class"].fillna(df["Class"].mode()[0], inplace=True)
df

C:\Users\admin\AppData\Local\Temp\ipykernel_4336\2617004827.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Class"].fillna(df["Class"].mode()[0], inplace=True)

    Student             Class  Year  Grade
0      Emma  Freshman Seminar   1.0   86.0
1    Olivia  Freshman Seminar   1.0   86.0
2      Noah  Freshman Seminar   1.0   86.0
3    Sophia  Freshman Seminar   1.0   87.0
4      Liam  Freshman Seminar   1.0   90.0
..      ...               ...   ...    ...
81      NaN   Intro to Python   2.0    NaN
82  Bennett   Intro to Python   2.0    NaN
83      NaN               EDA   3.0   84.0
84    Gavin               EDA   4.0    NaN
85   Calvin   Intro to Python   2.0  100.0

[86 rows x 4 columns]

In [69]:
# Resolving missing values in the 'Student' column
df["Student"].fillna(df["Student"].mode()[0], inplace=True)
df

C:\Users\admin\AppData\Local\Temp\ipykernel_4336\217650480.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Student"].fillna(df["Student"].mode()[0], inplace=True)

    Student             Class  Year  Grade
0      Emma  Freshman Seminar   1.0   86.0
1    Olivia  Freshman Seminar   1.0   86.0
2      Noah  Freshman Seminar   1.0   86.0
3    Sophia  Freshman Seminar   1.0   87.0
4      Liam  Freshman Seminar   1.0   90.0
..      ...               ...   ...    ...
81    Isaac   Intro to Python   2.0    NaN
82  Bennett   Intro to Python   2.0    NaN
83    Isaac               EDA   3.0   84.0
84    Gavin               EDA   4.0    NaN
85   Calvin   Intro to Python   2.0  100.0

[86 rows x 4 columns]

In [79]:
# Resolving missing values in the 'Grade' column
df['Grade'].fillna(df['Grade'].mean(), inplace=True) 
df['Grade'] = df['Grade'].round(1)  #  Round to 2 decimal places
df

C:\Users\admin\AppData\Local\Temp\ipykernel_4336\651984323.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Grade'].fillna(df['Grade'].mean(), inplace=True)

    Student             Class  Year  Grade
0      Emma  Freshman Seminar   1.0   86.0
1    Olivia  Freshman Seminar   1.0   86.0
2      Noah  Freshman Seminar   1.0   86.0
3    Sophia  Freshman Seminar   1.0   87.0
4      Liam  Freshman Seminar   1.0   90.0
..      ...               ...   ...    ...
81    Isaac   Intro to Python   2.0   85.7
82  Bennett   Intro to Python   2.0   85.7
83    Isaac               EDA   3.0   84.0
84    Gavin               EDA   4.0   85.7
85   Calvin   Intro to Python   2.0  100.0

[86 rows x 4 columns]

In [83]:
# Save the cleaned DataFrame to a new CSV file  
df.to_csv( 'Data/Student_Grades_Cleaned.csv', index=False)

In [ ]:
df